# Subsetting 

Review core methods to select data from a `pandas.Dataframe`

## Read in CSV

To read in a CSV file into our PYthon workspace as a `panda.DataFrame` we use the `pandas.read_csv` function:

In [1]:
import pandas as pd

# Read in file, argument is the file path as a string
df = pd.read_csv('data/wetlands_seasonal_bird_diversity.csv')

# Print df's first five rows
df.head()

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

Birds were surveyed in four wetlands: 

- Cap Salt Marsh (CSM)
- Mugu lagoon (MUL)
- San Dieguito Wetland (SDW)
- Tijuana Estuary (TJE)

Values from second column to the last column = number of different bird species recoreded across the surbery sites in each wetland during spring ,winter, and fall for a given year

year column = year on which data was collected

In [2]:
# Print df's column names
df.columns

Index(['year', 'CSM_winter', 'CSM_spring', 'CSM_fall', 'MUL_winter',
       'MUL_spring', 'MUL_fall', 'SDW_winter', 'SDW_spring', 'SDW_fall',
       'TJE_winter', 'TJE_spring', 'TJE_fall'],
      dtype='object')

In [3]:
# List dtypes of each column
df.dtypes

year            int64
CSM_winter    float64
CSM_spring    float64
CSM_fall      float64
MUL_winter    float64
MUL_spring    float64
MUL_fall      float64
SDW_winter    float64
SDW_spring    float64
SDW_fall      float64
TJE_winter    float64
TJE_spring    float64
TJE_fall      float64
dtype: object

In [4]:
# Print data frame's shape: output is a tuple (# rows, # columns)
df.shape

(14, 13)

## Select a single column

Simplest case: select a single column by column name

general syntax: 
```python
df['column_name']
```

This is an example of **label-based subsetting**, which means we want to select data from our df using the *names* of the columns, not their position. 

### Example
Select number of bird species observed at Mugu Lagoon in spring

In [6]:
# select a single column by using square brackets []
mul_spring = df['MUL_spring']
mul_spring

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

In [7]:
# Confirm the type of output is a series
print(type(mul_spring))

<class 'pandas.core.series.Series'>

Recall: we can think of a `panda.DataFrame` as a disctionary of its columns.
Then, we can access a single column name as the *key*, just like we would in a dictionary:

`df['column_name']`

In [8]:
df.MUL_spring

0      NaN
1     52.0
2     58.0
3     58.0
4     52.0
5     50.0
6     48.0
7     54.0
8     54.0
9     52.0
10     NaN
11    55.0
12    55.0
13    59.0
Name: MUL_spring, dtype: float64

** Favor `df['column_name']` instead of df.column_name

Why?

- `df.column_name` avoids conflicts with `pd.Dataframes` methods and attributes. For example, if `df` has a column named `count`, it's amibiguous whether `pd.count` is referring to the 'count()' method or the `count` column.

- `df['column_names']` can take any column name
- `df.column` only works if the column name has no spaces or special characters

## Selecting multiple columns...

### ...using a list of column names

Select multiple columns in a single call by passsing a list of column names to square brackets `[]`

```python
df[['col1','col2','col100']]
```
Notice the "double square barckets". This is because we are passing the list of names ``['col1','col2','col100']` to the selection brackets `[]`

## check-in

Is this labeled-based or location-based? Label

### Example

In [9]:
# Select columns with names 'TJE_winter' and 'TJE_fall'
tje_wf = df[['TJE_winter', 'TJE_fall']]
tje_wf

    TJE_winter  TJE_fall
0          NaN      81.0
1         67.0       NaN
2         70.0      69.0
3         69.0      64.0
4         60.0      62.0
5         73.0      64.0
6         76.0      58.0
7         72.0      57.0
8         66.0      55.0
9         63.0      50.0
10        54.0      54.0
11        53.0      51.0
12        60.0      60.0
13        60.0      38.0

In [10]:
type(tje_wf)

pandas.core.frame.DataFrame

### ... using a slice

To select a slice of the columns we will use a special case of **'loc' selection**. General syntax:

```python
df.loc[: , 'column_start':'column_end']
```
Notice:

- the first value passes to 'loc' is used for selecting rows, using a colon `:` as the row-selection parameter means "select all the rows"

- the slice of the resulting data frame includes both endpoints of the slice.

In [11]:
# Select columns between 'CSM_winter' and "MUL_fall"
csm_mul = df.loc[:, 'CSM_winter':'MUL_fall']
csm_mul.head()

   CSM_winter  CSM_spring  CSM_fall  MUL_winter  MUL_spring  MUL_fall
0        39.0        40.0      50.0        45.0         NaN      61.0
1        48.0        44.0       NaN        58.0        52.0       NaN
2        51.0        43.0      49.0        57.0        58.0      53.0
3        42.0        46.0      38.0        60.0        58.0      62.0
4        38.0        43.0      45.0        49.0        52.0      57.0

## Selecting rows...

### ...using a condition
To select rows that satisfy a particular condiction the general syntax is 
```python
df[condition_on_rows]
```

The `condition_on_rows` can be many things, let's see some usual scenarios.

### Example

We are interested in data after 2020.

In [12]:
# Select all rows with year > 2020
post_2020 = df[df['year']>2020]
post_2020

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

condition for our rows = `df['year'] > 2020`
this is a `panda.Series` with booooolean values ('True' of 'False') indicating which rows satisfy the condition year>2020

In [13]:
# Check the type of df['year'] >2020
print(type(df['year']>2020))

<class 'pandas.core.series.Series'>

In [14]:
# print the boolean seires
df['year']>2020

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12     True
13     True
Name: year, dtype: bool

When we pass such a series of boolean values to the selection brackets `[]` we keep only the rows that correspond to a `True` value.

## Check-in
Get the subset of the data frame on which the San Dieguito Wetland has at least 75 species recorded during spring.

In [15]:
sdw_spring_75 = df[df['SDW_spring']>=75]

In [16]:
print(sdw_spring_75)

   year  CSM_winter  CSM_spring  CSM_fall  MUL_winter  MUL_spring  MUL_fall  \
0  2010        39.0        40.0      50.0        45.0         NaN      61.0
4  2014        38.0        43.0      45.0        49.0        52.0      57.0

   SDW_winter  SDW_spring  SDW_fall  TJE_winter  TJE_spring  TJE_fall
0         NaN        75.0      85.0         NaN         NaN      81.0
4        61.0        78.0      71.0        60.0        81.0      62.0

In [17]:
df['SDW_spring']>=75

0      True
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
Name: SDW_spring, dtype: bool

Example
we want to look at data from years 2012 to 2015 including both years,One way of doing this is to use the between operator in our condition:

In [18]:
subset = df[df['year'].between(2012, 2015)]
subset

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0
5,2015,44.0,42.0,45.0,58.0,50.0,51.0,71.0,61.0,65.0,73.0,76.0,64.0

In [ ]:
df['year'].between(2012,2015)

Let’s break down this code:

1. df['year'] is the column with the year values, a pandas.Series

2. in df['year'].between(), we have that between is a method for the pandas.Series and we are calling it using the dot .

3. (2012, 2015) are the parameters for the between() method, from the pandas documentation we can see this method will subset including both endpoints

4. df['year'].between(2012, 2015) is then a pandas.Series of boolean values indicating which rows have year equal to 2012, 2013, 2014, or 2015.

5. when we put df['year'].between(2012, 2015) inside the selection brackets [] we obtain the rows of the data frame with year equal to 2012, …, 2015.

## Avoid using `loc` for selecting only rows

It is equivalent to write

In [21]:
# Select rows with year<2015
df[df['year']<2015]

# Select rows with year<2015 using loc
df.loc[df['year']<2015, :]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
1,2011,48.0,44.0,NaN,58.0,52.0,NaN,78.0,74.0,NaN,67.0,70.0,NaN
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0

we prefer the first syntax because it is simplier.

### using multiple conditions

We can combine multiple conditions to select rows by surrounding each condition in parenthesis `()` and using the or operator `|` and the and operator `&`.

## Example: or
Select rows in which CSM has more than 50 species registered in winter *or* fall:

In [22]:
df[(df['CSM_winter']>50)|(df['SDW_fall']>50)]

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
0,2010,39.0,40.0,50.0,45.0,NaN,61.0,NaN,75.0,85.0,NaN,NaN,81.0
2,2012,51.0,43.0,49.0,57.0,58.0,53.0,71.0,72.0,73.0,70.0,63.0,69.0
3,2013,42.0,46.0,38.0,60.0,58.0,62.0,69.0,70.0,70.0,69.0,74.0,64.0
4,2014,38.0,43.0,45.0,49.0,52.0,57.0,61.0,78.0,71.0,60.0,81.0,62.0
5,2015,44.0,42.0,45.0,58.0,50.0,51.0,71.0,61.0,65.0,73.0,76.0,64.0
6,2016,41.0,36.0,47.0,63.0,48.0,58.0,67.0,62.0,57.0,76.0,76.0,58.0
7,2017,46.0,41.0,43.0,57.0,54.0,53.0,66.0,45.0,54.0,72.0,63.0,57.0
8,2018,48.0,48.0,44.0,56.0,54.0,57.0,55.0,49.0,51.0,66.0,60.0,55.0
9,2019,39.0,39.0,40.0,57.0,52.0,53.0,54.0,55.0,53.0,63.0,54.0,50.0
10,2020,46.0,NaN,47.0,56.0,NaN,66.0,57.0,NaN,58.0,54.0,40.0,54.0
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

## Example: and
Select rows in which both the CSM and SDW have more than 60 species during spring

In [24]:
df[ (df['CSM_spring']>60) & (df['SDW_spring']>60)]

Empty DataFrame
Columns: [year, CSM_winter, CSM_spring, CSM_fall, MUL_winter, MUL_spring, MUL_fall, SDW_winter, SDW_spring, SDW_fall, TJE_winter, TJE_spring, TJE_fall]
Index: []

An empty data frame! That's ok, it just means there are no rows that satisfy the given condition. 

## select rows by position 
Sometimes we may want to select certain rows depending on their actual position in the data frame. In other words, using **position-based subsetting**. To do this, we use `iloc` **selection** with the syntax

```python
df.iloc[row-indices]
```

`iloc` = stands for integer-location based indexing

## Example:

In [25]:
# Select the fifth row (index=4)
df.iloc[4]

year          2014.0
CSM_winter      38.0
CSM_spring      43.0
CSM_fall        45.0
MUL_winter      49.0
MUL_spring      52.0
MUL_fall        57.0
SDW_winter      61.0
SDW_spring      78.0
SDW_fall        71.0
TJE_winter      60.0
TJE_spring      81.0
TJE_fall        62.0
Name: 4, dtype: float64

In [27]:
# Select rows 9 through 13, including 13
df.iloc[9:14] # endpoints not included

,year,CSM_winter,CSM_spring,CSM_fall,MUL_winter,MUL_spring,MUL_fall,SDW_winter,SDW_spring,SDW_fall,TJE_winter,TJE_spring,TJE_fall
9,2019,39.0,39.0,40.0,57.0,52.0,53.0,54.0,55.0,53.0,63.0,54.0,50.0
10,2020,46.0,NaN,47.0,56.0,NaN,66.0,57.0,NaN,58.0,54.0,40.0,54.0
11,2021,47.0,44.0,53.0,54.0,55.0,60.0,57.0,58.0,57.0,53.0,68.0,51.0
12,2022,40.0,46.0,49.0,60.0,55.0,65.0,57.0,60.0,57.0,60.0,61.0,60.0
13,2023,56.0,43.0,36.0,72.0,59.0,53.0,64.0,63.0,33.0,60.0,56.0,38.0

## Selecting rows and columns simultaneously

can be done using `loc` (labels) or `iloc` (positions).

### ... by labels or conditions
when we want to select rows and columns simultaneously by labels (including using conditions) we can use `loc` selection with the syntax:

```python
df.loc[row-selection, column-selection]
```
example:

Select winter surveys from MUL and TJE after 2020

In [28]:
df.loc[df['year']>2020, ['MUL_winter', 'TJE_winter', "year"]]

    MUL_winter  TJE_winter  year
11        54.0        53.0  2021
12        60.0        60.0  2022
13        72.0        60.0  2023

## selecting by position

Suppose we want to select rows 3-7 (including 7) and columns 4th and 5th column

In [29]:
df.iloc[3:8, [3,4]]

   CSM_fall  MUL_winter
3      38.0        60.0
4      45.0        49.0
5      45.0        58.0
6      47.0        63.0
7      43.0        57.0

## Notes about `iloc` and `loc`

### which one does what?

remember that the `i` in `iloc` stands for integer location and it uses integer indexing the same way as indexing for python list. 

### `iloc` for columns selection? avoid it 

We can also access columns by position using `iloc` - but best not to if possible.

Unless you are really looking for information about the 9th column, do not access a column by position. This is bound to break in many ways:

1. it relies on a person correctly counting the position of a column. Even with a small dataset this can be prone to error.

2. it is not explicit: if we want information about San Dieguito Wetland during spring, `df.SDW_spring` or `df['SDW_spring']` are explicitely telling us we are accessing that information. `df.iloc[:,8]` is obscure and uninformative.

3. datastets can get updated. Maybe a new column was added before SDW_spring, this would change the position of the column, which would make any code depending on df.iloc[:,8] invalid.

**Accessing columns by labels helps reproducivility!**